src/cf/Catalogs/ЗадачиАссистентаПоЗадачамСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗадачиАссистентаПоЗадачамСотрудника</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправления</Name>
					<Comment>8 - интервал 8-12, 12- интервал 12-16, 16 - интервал 16-20</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбщегоОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеобходимоПоприветствовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролируемыйСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательДляОповещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОповещения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособОповещенияАссистентаУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролируемыйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КалендарьСотрудникСотрудники</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтролируемыеСотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/СотрудникиПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияОткрытийЗадачПользователями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИсторияОткрытийЗадачПользователями</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОткрытияЗадачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗадачаСотрудника</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СпособОповещенияАссистентаУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособОповещенияАссистентаУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СообщениеКонтекстногоОбсужденияБезОповещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеКонтекстногоОбсужденияОтветственному</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеКонтекстногоОбсужденияПользователю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеОбщегоОбсуждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеЛичногоОбсужденияПользователю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщениеЛичногоОбсужденияОтветственному</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ЗадачаСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗадачаСотрудника</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолонкаКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КолонкиКалендарейСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеЗадачи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеСтроковаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесьДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Comment>Свойство</Comment>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение</Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТегиЗадач</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/КалендариСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КалендариСотрудников</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>backgroundColor</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>colorId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>foregroundColor</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>id</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>key</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>primary</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>selected</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>summary</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>timeZone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКалендаря</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СинхронизироватьСGoogle</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доступ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ЗадачиАссистентаПоЗадачамСотрудника/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоНовый = Ложь;
	ДополнительныеСвойства.Свойство("ЭтоНовый", ЭтоНовый);
	
	АссистентУправления.УдалитьЗапланированныеЗаписиЗадачи(Ссылка);
	ЗапланироватьНовыеЗадачи();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

//@skip-check module-empty-method
//@skip-check doc-comment-parameter-section
Процедура ПередВыполнениемЗадачи(Предмет, Источник, ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	
	
КонецПроцедуры

Процедура ВыполнитьЗадачу(Предмет, Источник, ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	ЭтоОтправкаСообщенияОбсуждения = ЭтоОтправкаСообщенияОбсуждения();
	ЭтоОтправкаEmail = ЭтоОтправкаEmail(); 
	Если Не ЭтоОтправкаEmail И Не ЭтоОтправкаСообщенияОбсуждения  Тогда
		ТекстОшибки = НСтр("ru='Не заполнен ни адрес электронной почты, ни обсуждение для отправки сообщения.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;      
	
	ПолучитьМассивКонтролируемыхСотрудников();
	ДанныеОСтатусеЗадач = ПолучитьДанныеПоСтатусуЗадач(); 
	ДанныеОНовыхЗадачах = ПолучитьДанныеОНовыхЗадачах();   
	Если ЭтоОтправкаEmail Тогда  
		ТекстСообщения = ТекстСообщенияОСтатусахЗадачHTML(ДанныеОСтатусеЗадач);	
	Иначе
		МассивТекстСообщения = ТекстСообщенияОСтатусахЗадачФорматСтрока(ДанныеОСтатусеЗадач, ДанныеОНовыхЗадачах);
	КонецЕсли;
	
	Если ЭтоОтправкаEmail Тогда  
		СоздатьEmail(ТекстСообщения);
	Иначе         

		Если НЕ ОбсужденияУНФ.ЭтоСеансАвторизованногоПользователя()	Тогда    
			ПользовательАссистент = АссистентУправления.ПользовательАссистент();
			Если ПользовательАссистент <> Неопределено И ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ПользовательАссистент)) Тогда
				ИдентификаторПользователяИБ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПользовательАссистент, "ИдентификаторПользователяИБ");
				СистемаВзаимодействия.УстановитьТекущегоПользователя(ИдентификаторПользователяИБ);   
			Иначе
				ТекстСообщенияОшибки = НСтр("ru='Не удалось определить пользователя Ассистента взаимодействия. Для создания пользователя внесите изменения во включенный навык Ассистента.'");
				ЗаписьЖурналаРегистрации("ОшибкаОтправкиОповещенияПользователюПоЗадачам", УровеньЖурналаРегистрации.Ошибка,, Ссылка, ТекстСообщенияОшибки);
				Возврат;
			КонецЕсли;
		КонецЕсли;
	
		Если ЗначениеЗаполнено(КалендарьОтправки) Тогда
			Если Не ЗначениеЗаполнено(ИдентификаторОбщегоОбсуждения) Тогда
				СоздатьГрупповойЧатПоКалендарю();	
			Иначе
				ОбновитьГрупповойЧатПоКалендарю();
			КонецЕсли; 
			ОбъектСообщения = ИдентификаторОбщегоОбсуждения;    
		ИначеЕсли ЗначениеЗаполнено(ИдентификаторОбщегоОбсуждения) Тогда 
			ОбъектСообщения = ИдентификаторОбщегоОбсуждения;    
		ИначеЕсли ЗначениеЗаполнено(ПользовательДляОповещения) Тогда
			ОбъектСообщения = ПользовательДляОповещения;     
		Иначе			ТекстОшибки = НСтр("ru='Не заполнен ни календарь, ни сотрудник для отправки сообщения.'");
			ВызватьИсключение ТекстОшибки;
		КонецЕсли; 
		Для Каждого ТекстСообщения Из МассивТекстСообщения Цикл 
			ДанныеСообщения = ОбсужденияУНФ.НовыйДанныеСообщения();       
			ДанныеСообщения.Текст = ТекстСообщения;         
			ДанныеСообщения.Объект = ОбъектСообщения;
			ДанныеСообщения.Автор = АссистентУправления.ПользовательАссистент(); 
			ОбсужденияУНФ.СоздатьСообщение(ДанныеСообщения);	
		КонецЦикла;
	КонецЕсли;  
	
КонецПроцедуры

Процедура ПослеВыполненияЗадачи(Предмет, Источник, ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
	Если НеобходимоПоприветствовать Тогда
		СброситьПризнакНеобходимоПоприветствовать();
	КонецЕсли;
	ЗапланироватьНовыеЗадачи();
	
КонецПроцедуры

Процедура ПоприветствоватьПользователяПередПервымВыполнением() Экспорт
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Используется Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоОтправкаСообщенияОбсуждения = ЭтоОтправкаСообщенияОбсуждения();
	ЭтоОтправкаEmail = ЭтоОтправкаEmail();
	
	Если Не ЭтоОтправкаEmail И Не ЭтоОтправкаСообщенияОбсуждения Тогда
		ТекстОшибки = НСтр("ru='Не заполнен ни адрес электронной почты, ни обсуждение для отправки сообщения.'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(КалендарьОтправки) И ТипОбсуждения = "Календарное" Тогда
		Если Не ЗначениеЗаполнено(ИдентификаторОбщегоОбсуждения) Тогда
			СоздатьГрупповойЧатПоКалендарю();	
		Иначе
			ОбновитьГрупповойЧатПоКалендарю();
		КонецЕсли; 
	КонецЕсли; 
	
	ДанныеСообщения = ОбсужденияУНФ.НовыйДанныеСообщения();
	ДанныеСообщения.Текст = ТекстСообщенияПриветствиеПередПервымВыполнением();
	ДанныеСообщения.Получатель = Пользователи.АвторизованныйПользователь();
	СоздатьСообщениеОбсуждения(ДанныеСообщения, Истина);
	
	НовыеЗадачиКВыполнению = АссистентУправления.НовыйТаблицаРегулярныхЗадачКВыполнению();
	НоваяЗадача = НовыеЗадачиКВыполнению.Добавить();
	НоваяЗадача.Дата = НачалоДня(ТекущаяДатаСеанса());
	НоваяЗадача.Задача = Ссылка;
	
	АссистентУправления.ЗапланироватьВыполнениеРегулярныхЗадач(НовыеЗадачиКВыполнению);
	АссистентУправления.ВыполнитьРегулярныеЗадачиСейчасВФоне();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗапланироватьНовыеЗадачи()
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Используется Тогда
		Возврат;
	КонецЕсли;
	
	НовыеЗадачиКВыполнению = АссистентУправления.НовыйТаблицаРегулярныхЗадачКВыполнению();
	Справочники.ЗадачиАссистентаПоЗадачамСотрудника.ЗапланироватьЗадачиКВыполнению(
		НовыеЗадачиКВыполнению, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка));
	Если НовыеЗадачиКВыполнению.Количество() <> 0 Тогда
		АссистентУправления.ЗапланироватьВыполнениеРегулярныхЗадач(НовыеЗадачиКВыполнению);
	КонецЕсли;
	
КонецПроцедуры

Функция ТекстСообщенияПриветствиеПередПервымВыполнением()
	
	ТекстСообщения = НСтр("ru='Теперь я буду следить за статусом задач.'");  
	
	ДобавитьТекстДобрыйДень(ТекстСообщения);
	Возврат ТекстСообщения;
	
КонецФункции

Процедура ДобавитьТекстДобрыйДень(ТекстСообщения)
	
	КомпонентыСтроки = Новый Массив;
	КомпонентыСтроки.Добавить(НСтр("ru='Добрый день!'")); // АПК:374
	КомпонентыСтроки.Добавить(Символы.ПС);
	КомпонентыСтроки.Добавить(Символы.ПС);
	КомпонентыСтроки.Добавить(ТекстСообщения);
	ТекстСообщения = СтрСоединить(КомпонентыСтроки);
	
КонецПроцедуры

Функция ЭтоОтправкаEmail()
	
	Возврат ЗначениеЗаполнено(УчетнаяЗапись) И (ЗначениеЗаполнено(ПользовательДляОповещения));
	
КонецФункции    

Функция ЭтоОтправкаСообщенияОбсуждения()
	
	Если СпособОповещения = Перечисления.СпособОповещенияАссистентаУправления.СообщениеЛичногоОбсужденияПользователю
		И ЗначениеЗаполнено(ПользовательДляОповещения) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если СпособОповещения = Перечисления.СпособОповещенияАссистентаУправления.СообщениеОбщегоОбсуждения
		И ЗначениеЗаполнено(ИдентификаторОбщегоОбсуждения) ИЛИ ЗначениеЗаполнено(КалендарьОтправки) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции       

Процедура СоздатьEmail(ТекстСообщения)
	
	АдресаЭлектроннойПочты = Новый Массив;

	Если ЗначениеЗаполнено(ПользовательДляОповещения) Тогда
		ПредставлениеПолучателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПользовательДляОповещения, "Наименование");
		КонтактнаяИнформацияПользователя = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			ПользовательДляОповещения, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,, Ложь);    
		Для каждого ДанныеКонтактнойИнформации Из КонтактнаяИнформацияПользователя Цикл
			ОписаниеПолучателя = Новый Структура;
			ОписаниеПолучателя.Вставить("Адрес", ДанныеКонтактнойИнформации.Представление);
			ОписаниеПолучателя.Вставить("Представление", ПредставлениеПолучателя);
			АдресаЭлектроннойПочты.Добавить(ОписаниеПолучателя);
		КонецЦикла;    
	КонецЕсли;		

	Если АдресаЭлектроннойПочты.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='У пользователя %1 не указано ни одного адреса электронной почты'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, Строка(ПользовательДляОповещения));
		ЗаписьЖурналаРегистрации("ОшибкаОтправкиПочтовогоОповещенияПользователюПоЗадаче", УровеньЖурналаРегистрации.Предупреждение,,ПользовательДляОповещения, ТекстСообщения);
		Возврат;
	КонецЕсли;	
	
	ШаблонЗаголовок = НСтр("ru='Статусы задач по %1'"); 
	Если КалендарьСотрудникСотрудники = 0 Тогда 
		СтрокаПо = "сотруднику " + КонтролируемыйСотрудник;	 
	ИначеЕсли КалендарьСотрудникСотрудники = 1 Тогда	   
		СтрокаПо = "календарю " + КонтролируемыйКалендарь;
	Иначе
		СтрокаПо = "нескольким сотрудникам";
	КонецЕсли;
	Тема = СтрШаблон(ШаблонЗаголовок, СтрокаПо);
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", АдресаЭлектроннойПочты);
	ПараметрыПисьма.Вставить("Тема", Тема);
	ПараметрыПисьма.Вставить("Тело", ТекстСообщения);
	ПараметрыПисьма.Вставить("ТипТекста", "HTML");
	ПочтовоеСообщение = РаботаСПочтовымиСообщениями.ПодготовитьПисьмо(УчетнаяЗапись, ПараметрыПисьма);
	РаботаСПочтовымиСообщениями.ОтправитьПисьмо(УчетнаяЗапись, ПочтовоеСообщение);
	
КонецПроцедуры

Процедура СоздатьСообщениеОбсуждения(ДанныеСообщения, ОтправитьСейчас = Ложь)
	
	Если ЗначениеЗаполнено(ИдентификаторОбщегоОбсуждения) Тогда
		ДанныеСообщения.Объект = Новый ИдентификаторОбсужденияСистемыВзаимодействия(ИдентификаторОбщегоОбсуждения);
	ИначеЕсли ЗначениеЗаполнено(ПользовательДляОповещения) Тогда
		ДанныеСообщения.Объект = ПользовательДляОповещения;
	Иначе
		ТекстОшибки = НСтр("ru='У задачи не заполнены параметры: ""Пользователь для оповещения"" или ""Общее обсуждение"".'");
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	ДанныеСообщения.Автор = АссистентУправления.ПользовательАссистент();
	
	Если ОтправитьСейчас Тогда
		ОбсужденияУНФ.СоздатьСообщение(ДанныеСообщения);
	Иначе
		ОбсужденияУНФ.СоздатьСообщениеОтложенно(ДанныеСообщения);
	КонецЕсли;
	
КонецПроцедуры

Процедура СброситьПризнакНеобходимоПоприветствовать()
	
	ОбменДаннымиЗагрузка = ОбменДанными.Загрузка;
	ОбменДанными.Загрузка = Истина;
	НеобходимоПоприветствовать = Ложь;
	Записать();
	ОбменДанными.Загрузка = ОбменДаннымиЗагрузка;
	
КонецПроцедуры

Функция ПолучитьДанныеПоСтатусуЗадач()
	
	МассивСотрудников = ПолучитьМассивКонтролируемыхСотрудников();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачаСотрудника.Ответственный КАК Ответственный,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗадачаСотрудника.Ссылка) КАК КоличествоНовых
		|ПОМЕСТИТЬ втНовыхЗадачЗаВчера
		|ИЗ
		|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
		|ГДЕ
		|	ЗадачаСотрудника.Дата >= &ДатаВчера
		|	И ЗадачаСотрудника.Ответственный В(&МассивСотрудников)
		|	И ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадачаСотрудника.Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗадачаСотрудника.Ответственный КАК Ответственный,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗадачаСотрудника.Ссылка) КАК КоличествоВыполненных
		|ПОМЕСТИТЬ втВыполненоЗадачЗаВчера
		|ИЗ
		|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
		|ГДЕ
		|	ЗадачаСотрудника.Ответственный В(&МассивСотрудников)
		|	И ЗадачаСотрудника.Выполнена = ИСТИНА
		|	И ЗадачаСотрудника.ДатаВыполнения >= &ДатаВчера
		|	И ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадачаСотрудника.Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗадачаСотрудника.Ответственный КАК Ответственный,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗадачаСотрудника.Ссылка) КАК КоличествоПросроченных
		|ПОМЕСТИТЬ втЗадачПросрочено
		|ИЗ
		|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
		|ГДЕ
		|	ЗадачаСотрудника.ДатаНачала <> &ПустаяДата
		|	И ЗадачаСотрудника.ДатаОкончания <> &ПустаяДата
		|	И ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ
		|	И ЗадачаСотрудника.Выполнена = ЛОЖЬ
		|	И ЗадачаСотрудника.ДатаОкончания <= &ТекДата
		|	И ЗадачаСотрудника.Ответственный В(&МассивСотрудников)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадачаСотрудника.Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗадачаСотрудника.Ответственный КАК Ответственный,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗадачаСотрудника.Ссылка) КАК КоличествоПриближающихся
		|ПОМЕСТИТЬ втПриближающиесяЗадачи
		|ИЗ
		|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
		|ГДЕ
		|	ЗадачаСотрудника.Ответственный В(&МассивСотрудников)
		|	И ЗадачаСотрудника.ДатаНачала <> &ПустаяДата
		|	И ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ
		|	И ЗадачаСотрудника.ДатаНачала >= &ДатаСегодня
		|	И ЗадачаСотрудника.ДатаНачала <= &КонецДня
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадачаСотрудника.Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗадачаСотрудника.Ссылка КАК Задача,
		|	ЗадачаСотрудника.Ответственный КАК Ответственный,
		|	СотрудникиПользователя.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ втПользователиСотрудника
		|ИЗ
		|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
		|		ПО ЗадачаСотрудника.Ответственный = СотрудникиПользователя.Сотрудник
		|ГДЕ
		|	ЗадачаСотрудника.Ответственный В(&МассивСотрудников)
		|	И ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ
		|	И ЗадачаСотрудника.ДатаПоследнегоИзменения <> &ПустаяДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПользователиСотрудника.Ответственный КАК Ответственный,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ втПользователиСотрудника.Задача) КАК КоличествоНеоткрытых
		|ПОМЕСТИТЬ втНеоткрытыеЗадачи
		|ИЗ
		|	втПользователиСотрудника КАК втПользователиСотрудника
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияОткрытийЗадачПользователями КАК ИсторияОткрытийЗадачПользователями
		|		ПО втПользователиСотрудника.Задача = ИсторияОткрытийЗадачПользователями.Задача
		|			И втПользователиСотрудника.Пользователь = ИсторияОткрытийЗадачПользователями.Пользователь
		|ГДЕ
		|	ИсторияОткрытийЗадачПользователями.ДатаОткрытияЗадачи ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	втПользователиСотрудника.Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗадачаСотрудника.Ответственный КАК Ответственный,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗадачаСотрудника.Ссылка) КАК КоличествоВсего
		|ПОМЕСТИТЬ втКоличествоВсего
		|ИЗ
		|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
		|ГДЕ
		|	ЗадачаСотрудника.Ответственный В(&МассивСотрудников)
		|	И ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ
		|	И ЗадачаСотрудника.Выполнена = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадачаСотрудника.Ответственный
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Сотрудники.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(втНовыхЗадачЗаВчера.КоличествоНовых, 0) КАК КоличествоНовых,
		|	ЕСТЬNULL(втВыполненоЗадачЗаВчера.КоличествоВыполненных, 0) КАК КоличествоВыполненных,
		|	ЕСТЬNULL(втЗадачПросрочено.КоличествоПросроченных, 0) КАК КоличествоПросроченных,
		|	ЕСТЬNULL(втПриближающиесяЗадачи.КоличествоПриближающихся, 0) КАК КоличествоПриближающихся,
		|	ЕСТЬNULL(втКоличествоВсего.КоличествоВсего, 0) КАК КоличествоВсего,
		|	ЕСТЬNULL(втНеоткрытыеЗадачи.КоличествоНеоткрытых, 0) КАК КоличествоНеоткрытых
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ втНовыхЗадачЗаВчера КАК втНовыхЗадачЗаВчера
		|		ПО Сотрудники.Ссылка = втНовыхЗадачЗаВчера.Ответственный
		|		ЛЕВОЕ СОЕДИНЕНИЕ втВыполненоЗадачЗаВчера КАК втВыполненоЗадачЗаВчера
		|		ПО Сотрудники.Ссылка = втВыполненоЗадачЗаВчера.Ответственный
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЗадачПросрочено КАК втЗадачПросрочено
		|		ПО Сотрудники.Ссылка = втЗадачПросрочено.Ответственный
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПриближающиесяЗадачи КАК втПриближающиесяЗадачи
		|		ПО Сотрудники.Ссылка = втПриближающиесяЗадачи.Ответственный
		|		ЛЕВОЕ СОЕДИНЕНИЕ втКоличествоВсего КАК втКоличествоВсего
		|		ПО Сотрудники.Ссылка = втКоличествоВсего.Ответственный
		|		ЛЕВОЕ СОЕДИНЕНИЕ втНеоткрытыеЗадачи КАК втНеоткрытыеЗадачи
		|		ПО Сотрудники.Ссылка = втНеоткрытыеЗадачи.Ответственный
		|ГДЕ
		|	Сотрудники.Ссылка В(&МассивСотрудников)";
	
	Запрос.УстановитьПараметр("ДатаВчера",  НачалоДня(НачалоДня(ТекущаяДатаСеанса())-1));
	Запрос.УстановитьПараметр("ДатаСегодня", НачалоДня(ТекущаяДатаСеанса()));  
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));  
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());  
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекущаяДатаСеанса()));  

	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьДанныеОНовыхЗадачах()
	
	МассивСотрудников = ПолучитьМассивКонтролируемыхСотрудников();   
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗадачаСотрудника.Ответственный КАК Ответственный,
	|	ЗадачаСотрудника.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
	|ГДЕ
	|	ЗадачаСотрудника.Ответственный В(&МассивСотрудников)
	|	И ЗадачаСотрудника.ДатаНачала <> &ПустаяДата
	|	И ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ
	|	И ЗадачаСотрудника.ДатаНачала >= &ДатаСегодня
	|	И ЗадачаСотрудника.ДатаНачала <= &КонецДня";
	Запрос.УстановитьПараметр("ДатаСегодня", НачалоДня(ТекущаяДатаСеанса()));  
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекущаяДатаСеанса()));  
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));  
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);

	Возврат Запрос.Выполнить().Выгрузить();	
	
КонецФункции	

Функция ПолучитьМассивКонтролируемыхСотрудников()
	
	МассивСотрудников = Новый Массив;
	Если КалендарьСотрудникСотрудники = 0 Тогда   
		МассивСотрудников.Добавить(КонтролируемыйСотрудник);
	ИначеЕсли КалендарьСотрудникСотрудники = 1 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КалендариСотрудниковДоступ.Сотрудник КАК Сотрудник
		|ИЗ
		|	Справочник.КалендариСотрудников.Доступ КАК КалендариСотрудниковДоступ
		|ГДЕ
		|	КалендариСотрудниковДоступ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	КалендариСотрудников.ВладелецКалендаря
		|ИЗ
		|	Справочник.КалендариСотрудников КАК КалендариСотрудников
		|ГДЕ
		|	КалендариСотрудников.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", КонтролируемыйКалендарь);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивСотрудников.Добавить(ВыборкаДетальныеЗаписи.Сотрудник);
		КонецЦикла;
	Иначе
		Для Каждого Строка Из КонтролируемыеСотрудники Цикл
			МассивСотрудников.Добавить(Строка.Сотрудник);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивСотрудников; 
	
КонецФункции

Функция ПолучитьПользователейКалендаряОтправки()
	
	МассивПользователей = Новый Массив;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КалендариСотрудниковДоступ.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ втСотрудникиОтправки
		|ИЗ
		|	Справочник.КалендариСотрудников.Доступ КАК КалендариСотрудниковДоступ
		|ГДЕ
		|	КалендариСотрудниковДоступ.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	КалендариСотрудников.ВладелецКалендаря
		|ИЗ
		|	Справочник.КалендариСотрудников КАК КалендариСотрудников
		|ГДЕ
		|	КалендариСотрудников.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СотрудникиПользователя.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.СотрудникиПользователя КАК СотрудникиПользователя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втСотрудникиОтправки КАК втСотрудникиОтправки
		|		ПО СотрудникиПользователя.Сотрудник = втСотрудникиОтправки.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", КалендарьОтправки);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивПользователей.Добавить(ВыборкаДетальныеЗаписи.Пользователь);
	КонецЦикла;
	
	Возврат МассивПользователей;
	
КонецФункции
   
Функция ТекстСообщенияОСтатусахЗадачФорматСтрока(ДанныеОСтатусеЗадач, ДанныеОНовыхЗадачах)   
	
	МассивСотрудников = ПолучитьМассивКонтролируемыхСотрудников();    
	ТекстШапки = "Информация о состоянии задач ";
	Если КалендарьСотрудникСотрудники = 0 Тогда
		ТекстШапки = ТекстШапки + "сотрудника " + МассивСотрудников[0]; 	
	ИначеЕсли КалендарьСотрудникСотрудники = 1 Тогда	   
		ТекстШапки = ТекстШапки + "сотрудников календаря " + КонтролируемыйКалендарь;	
	Иначе
		ТекстШапки = ТекстШапки + "нескольких сотрудников";			
	КонецЕсли;                                           
	
	ТекстШапки = ТекстШапки + " на "  + Формат(ТекущаяДатаСеанса(), "ДЛФ=ДД") + ", " + Формат(ТекущаяДатаСеанса(), "ДФ=ЧЧ:мм") + ":";
	ТекстСообщения = Новый Массив; 
	ТекстСообщения.Добавить(ТекстШапки);
	ТекстСообщения.Добавить(Символы.ПС);     
	
	МассивСообщений = Новый Массив;
	Для Каждого Строка Из ДанныеОСтатусеЗадач Цикл
		Если МассивСотрудников.Количество() > 1 Тогда  
			ТекстСообщения.Добавить(Символы.ПС);	
			ТекстСообщения.Добавить("По сотруднику " + Строка.Ссылка);	
		КонецЕсли;        
		ТекстСообщения.Добавить(Символы.ПС);		
		ПараметрыСтроки = Новый Структура;
		ПараметрыСтроки.Вставить("ПереходИзОбсужденияСтатусЗадач", Истина);	
		ПараметрыСтроки.Вставить("СотрудникСтатусЗадач", Строка.Ссылка);	
		ПараметрыСтроки.Вставить("ПоказательСтатусаЗадач", "Всего");                                        
		ДобавитьФорматированнуюСтрокуСГиперссылкойСписокЗадач(ТекстСообщения, ПараметрыСтроки, "К выполнению : ", Строка.КоличествоВсего);
		ПараметрыСтроки.ПоказательСтатусаЗадач = "Просроченных";
		ДобавитьФорматированнуюСтрокуСГиперссылкойСписокЗадач(ТекстСообщения, ПараметрыСтроки, "Просрочено   : ", Строка.КоличествоПросроченных); 
		ПараметрыСтроки.ПоказательСтатусаЗадач = "Неоткрытых";   
		ДобавитьФорматированнуюСтрокуСГиперссылкойСписокЗадач(ТекстСообщения, ПараметрыСтроки, "Не открыто   : ", Строка.КоличествоНеоткрытых);
		ПараметрыСтроки.ПоказательСтатусаЗадач = "Новых";
		ДобавитьФорматированнуюСтрокуСГиперссылкойСписокЗадач(ТекстСообщения, ПараметрыСтроки, "Новые        : ", Строка.КоличествоНовых);
		ПараметрыСтроки.ПоказательСтатусаЗадач = "Выполненных";
		ДобавитьФорматированнуюСтрокуСГиперссылкойСписокЗадач(ТекстСообщения, ПараметрыСтроки, "Выполнено    : ", Строка.КоличествоВыполненных);  
		Если ВремяОтправления = 8 Тогда		
			ПараметрыСтроки.ПоказательСтатусаЗадач = "Приближающихся";   
			ДобавитьФорматированнуюСтрокуСГиперссылкойСписокЗадач(ТекстСообщения, ПараметрыСтроки, "Сегодня      : ", Строка.КоличествоПриближающихся);   
			СтрокиНовыеЗадачи = ДанныеОНовыхЗадачах.НайтиСтроки(Новый Структура("Ответственный", Строка.Ссылка));    
			Итератор = 1;       
			ЕстьНовые = СтрокиНовыеЗадачи.Количество() > 0;
			Если ЕстьНовые = Истина Тогда
				ФормСтрока = Новый ФорматированнаяСтрока(ТекстСообщения);
				МассивСообщений.Добавить(ФормСтрока); 
				ТекстСообщения.Очистить();
			КонецЕсли;    
			ФормСтрока = Новый ФорматированнаяСтрока(ТекстСообщения);

			Для Каждого СтрокаНоваяЗадача Из СтрокиНовыеЗадачи Цикл 
				//@skip-check new-font
				МоноширинныйШрифт = Новый Шрифт("Courier New", 10, Истина);   
				ТекстСообщения.Добавить(Новый ФорматированнаяСтрока(Строка(Итератор) + ". ", МоноширинныйШрифт));      
				ТекстСообщения.Добавить(Новый ФорматированнаяСтрока(ПолучитьНавигационнуюСсылку(СтрокаНоваяЗадача.Ссылка)));      
				ТекстСообщения.Добавить(Символы.ПС);		
				Итератор = Итератор + 1;	        
				Если Итератор > 15 И СтрокиНовыеЗадачи.Количество() >= 15 Тогда  
					ТекстСообщения.Добавить(Новый ФорматированнаяСтрока("Еще...",МоноширинныйШрифт,,,
						ПолучитьНавигационнуюСсылку(Метаданные.Документы.ЗадачаСотрудника, "ДанныеКонтроля", ПараметрыСтроки)));
					Прервать;
				КонецЕсли;    
			КонецЦикла;
		КонецЕсли;    
		ФормСтрока = Новый ФорматированнаяСтрока(ТекстСообщения);
		МассивСообщений.Добавить(ФормСтрока); 
		ТекстСообщения.Очистить();
	КонецЦикла;      
	
	Возврат МассивСообщений;	
	
КонецФункции

Функция ТекстСообщенияОСтатусахЗадачHTML(ДанныеОСтатусеЗадач)   

	ДанныеМакета = Справочники.ЗадачиАссистентаПоЗадачамСотрудника.ПолучитьМакет("МакетШаблонСообщения"); 
	ТекстСообщения = ДанныеМакета.ПолучитьТекст();  
	НачалоБлокаСотрудник = СтрНайти(ТекстСообщения,"$БлокСотрудник$");
	КонецБлокаСотрудник = СтрНайти(ТекстСообщения,"$БлокСотрудник$", НаправлениеПоиска.СКонца);
	ШаблонНачалоПисьма = Лев(ТекстСообщения,НачалоБлокаСотрудник - 2);
	ШаблонКонецПисьма = Сред(ТекстСообщения,КонецБлокаСотрудник + 16);

	ТекстСотрудники = Сред(ТекстСообщения,НачалоБлокаСотрудник + 16, КонецБлокаСотрудник - НачалоБлокаСотрудник - 16);
	МассивСотрудников = ПолучитьМассивКонтролируемыхСотрудников();    
	ТекстШапки = "состоянии задач ";
	Если КалендарьСотрудникСотрудники = 0 Тогда
		ТекстШапки = ТекстШапки + "сотрудника " + МассивСотрудников[0]; 	
	ИначеЕсли КалендарьСотрудникСотрудники = 1 Тогда	   
		ТекстШапки = ТекстШапки + "сотрудников календаря " + КонтролируемыйКалендарь;	
	Иначе
		ТекстШапки = ТекстШапки + "нескольких сотрудников";			
	КонецЕсли;                                           
	
	ТекстШапки = ТекстШапки + " на " + Формат(ТекущаяДатаСеанса(), "ДЛФ=ДД") + ", " + Формат(ТекущаяДатаСеанса(), "ДФ=ЧЧ:мм");
	ТекстПисьма = СтрЗаменить(ШаблонНачалоПисьма, "$Информация$", ТекстШапки); 
	Для Каждого Строка Из ДанныеОСтатусеЗадач Цикл  
		ТекстСотрудник = ТекстСотрудники;     		
		ТекстСотрудник = СтрЗаменить(ТекстСотрудник, "$Сотрудник$", Строка(Строка.Ссылка));
		ТекстСотрудник = СтрЗаменить(ТекстСотрудник, "$Всего$", Строка(Строка.КоличествоВсего) + " (за весь период)");
		ТекстСотрудник = СтрЗаменить(ТекстСотрудник, "$Просроченных$", Строка(Строка.КоличествоПросроченных) + " (за весь период)");   
		ТекстСотрудник = СтрЗаменить(ТекстСотрудник, "$Неоткрытых$", Строка(Строка.КоличествоНеоткрытых) + " (за весь период)");   
		ТекстСотрудник = СтрЗаменить(ТекстСотрудник, "$Новых$", Строка(Строка.КоличествоНовых) + ПолучитьПредставлениеПериодаВчераСегодня());   
		ТекстСотрудник = СтрЗаменить(ТекстСотрудник, "$Выполненных$", Строка(Строка.КоличествоВыполненных) + ПолучитьПредставлениеПериодаВчераСегодня());   
		ТекстСотрудник = СтрЗаменить(ТекстСотрудник, "$Сегодня$", Строка.КоличествоПриближающихся);   	
		ТекстПисьма = ТекстПисьма + ТекстСотрудник; 
	КонецЦикла;                                                                                       
	
	ТекстПисьма = ТекстПисьма + ШаблонКонецПисьма;
	Возврат ТекстПисьма;
	
КонецФункции

Функция СоздатьГрупповойЧатПоКалендарю()
	
	УстановитьПривилегированныйРежим(Истина);
	МассивПользователей = ПолучитьПользователейКалендаряОтправки();
	
	НовоеОбсуждение = СистемаВзаимодействия.СоздатьОбсуждение();
	НовоеОбсуждение.Групповое = Истина;
	Для Каждого Пользователь Из МассивПользователей Цикл
		ИдентификаторПользователя = Обсуждения.ПользовательСистемыВзаимодействия(Пользователь, Истина);
		НовоеОбсуждение.Участники.Добавить(ИдентификаторПользователя);  
	КонецЦикла;  
	
	ШаблонЗаголовок = НСтр("ru='%1: по %2'"); 
	Если КалендарьСотрудникСотрудники = 0 Тогда 
		СтрокаПо = "сотруднику " + КонтролируемыйСотрудник;	 
	ИначеЕсли КалендарьСотрудникСотрудники = 1 Тогда	   
		СтрокаПо = "календарю " + КонтролируемыйКалендарь;
	Иначе
		СтрокаПо = "нескольким сотрудникам";
	КонецЕсли;                  
	НовыйЗаголовок = СтрШаблон(ШаблонЗаголовок, Строка(КалендарьОтправки), СтрокаПо);
	НовоеОбсуждение.Заголовок = НовыйЗаголовок; 
	НовоеОбсуждение.Записать();    

	ОбменДанными.Загрузка = Истина;
	ИдентификаторОбщегоОбсуждения = НовоеОбсуждение.Идентификатор;
	Записать();
	ОбменДанными.Загрузка = Ложь;
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат НовоеОбсуждение;
	
КонецФункции 

Процедура ОбновитьГрупповойЧатПоКалендарю()
	
	УстановитьПривилегированныйРежим(Истина);       

	ШаблонЗаголовок = НСтр("ru='%1: по %2'"); 
	Если КалендарьСотрудникСотрудники = 0 Тогда 
		СтрокаПо = "сотруднику " + КонтролируемыйСотрудник;	 
	ИначеЕсли КалендарьСотрудникСотрудники = 1 Тогда	   
		СтрокаПо = "календарю " + КонтролируемыйКалендарь;
	Иначе
		СтрокаПо = "нескольким сотрудникам";
	КонецЕсли;                  
	НовыйЗаголовок = СтрШаблон(ШаблонЗаголовок, Строка(КалендарьОтправки), СтрокаПо);
	
	МассивПользователей = ПолучитьПользователейКалендаряОтправки();
	ОбновляемоеОбсуждение = СистемаВзаимодействия.ПолучитьОбсуждение(Новый ИдентификаторОбсужденияСистемыВзаимодействия(ИдентификаторОбщегоОбсуждения));
    ЕстьИзменения = Ложь;                                                                                  
	МассивИдентификаторовАктуальныхПользователей = Новый Массив;
	Для Каждого Пользователь Из МассивПользователей Цикл
		ИдентификаторПользователя = Обсуждения.ПользовательСистемыВзаимодействия(Пользователь, Истина);
		МассивИдентификаторовАктуальныхПользователей.Добавить(ИдентификаторПользователя);
		Если НЕ ОбновляемоеОбсуждение.Участники.Содержит(ИдентификаторПользователя) Тогда
			ОбновляемоеОбсуждение.Участники.Добавить(ИдентификаторПользователя); 
			ЕстьИзменения = Истина;
		КонецЕсли;
	КонецЦикла;      
	
	МассивНеактуальныхИдентификаторов = Новый Массив;
	Для Каждого Участник Из ОбновляемоеОбсуждение.Участники Цикл
		Если МассивИдентификаторовАктуальныхПользователей.Найти(Участник) = Неопределено Тогда	
			МассивНеактуальныхИдентификаторов.Добавить(Участник);
		КонецЕсли;
	КонецЦикла;       
	
	Для Каждого НеактуальныйУчастник Из МассивНеактуальныхИдентификаторов Цикл
	   	ОбновляемоеОбсуждение.Участники.Удалить(НеактуальныйУчастник); 
		ЕстьИзменения = Истина;
	КонецЦикла;       
	
	Если ОбновляемоеОбсуждение.Заголовок <> НовыйЗаголовок Тогда
		ОбновляемоеОбсуждение.Заголовок = НовыйЗаголовок;	
		ЕстьИзменения = Истина;
	КонецЕсли;      
	
	Если ЕстьИзменения = Истина Тогда
		ОбновляемоеОбсуждение.Записать(); 
	КонецЕсли;
		
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры 

Процедура ДобавитьФорматированнуюСтрокуСГиперссылкойСписокЗадач(ТекстСообщения, ПараметрыСтроки, ЛеваяЧасть, ПредставлениеСсылки )
	
	//@skip-check new-font
	МоноширинныйШрифт = Новый Шрифт("Courier New", 10, Истина);
	Если Строка(ПредставлениеСсылки) = "0" Тогда   
		ФормСтрока = Новый ФорматированнаяСтрока(ЛеваяЧасть + ПредставлениеСсылки, МоноширинныйШрифт); 		
		ТекстСообщения.Добавить(ФормСтрока);                                                            
 		ДобавитьРасшифровкуВСкобках(ТекстСообщения, ПараметрыСтроки, МоноширинныйШрифт);		
	Иначе	
		ТекстСообщения.Добавить(Новый ФорматированнаяСтрока(ЛеваяЧасть, МоноширинныйШрифт));      
		ФормСтрока = Новый ФорматированнаяСтрока(Строка(ПредставлениеСсылки), МоноширинныйШрифт
		,,,
		?(ЭтоОтправкаEmail() = Ложь, ПолучитьНавигационнуюСсылку(Метаданные.Документы.ЗадачаСотрудника, "ДанныеКонтроля", ПараметрыСтроки), "")); 
		ТекстСообщения.Добавить(ФормСтрока);    
 		ДобавитьРасшифровкуВСкобках(ТекстСообщения, ПараметрыСтроки, МоноширинныйШрифт);		
	                                   
		Если ПараметрыСтроки.Свойство("ПоказательСтатусаЗадач") И ПараметрыСтроки.ПоказательСтатусаЗадач = "Приближающихся" Тогда
			ТекстСообщения.Добавить(Новый ФорматированнаяСтрока(", подробнее:", МоноширинныйШрифт));      
		КонецЕсли;
	КонецЕсли;

	ТекстСообщения.Добавить(Символы.ПС);		

КонецПроцедуры

Процедура ДобавитьРасшифровкуВСкобках(ТекстСообщения, ПараметрыСтроки, МоноширинныйШрифт) 
	
	Если ПараметрыСтроки.Свойство("ПоказательСтатусаЗадач") Тогда	
		Показатель = ПараметрыСтроки.ПоказательСтатусаЗадач;  
		ФормСтрока = "";		
		Если Показатель = "Всего" ИЛИ Показатель = "Просроченных" ИЛИ Показатель = "Неоткрытых" Тогда 
			//@skip-check new-color
			ФормСтрока = Новый ФорматированнаяСтрока(" (за весь период)", МоноширинныйШрифт, Новый Цвет(125,125,125)); 
		ИначеЕсли Показатель = "Новых" ИЛИ Показатель = "Выполненных" Тогда
			СтрокаПериод = ПолучитьПредставлениеПериодаВчераСегодня();
			//@skip-check new-color
			ФормСтрока = Новый ФорматированнаяСтрока(СтрокаПериод, МоноширинныйШрифт, Новый Цвет(125,125,125)); 
		КонецЕсли;   
		
		ТекстСообщения.Добавить(ФормСтрока);    
		
	КонецЕсли;		
	
КонецПроцедуры	   

Функция ПолучитьПредставлениеПериодаВчераСегодня()
	
	Возврат " (за " + Строка(Формат(НачалоДня(НачалоДня(ТекущаяДатаСеанса()) - 1), "ДФ=дд.ММ")) + " - "
			+ Строка(Формат(НачалоДня(ТекущаяДатаСеанса()), "ДФ=дд.ММ")) + ")";
	
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
